export const historyNode = [
  {
    x: Date.UTC(1896),
    name: "19世纪末",
    label: "纸浆杂志在欧美大陆风行",
    description:
      "“Pulp Magzine”是一种起于19世纪末、终于20世纪50年代的廉价故事杂志。" +
      "从埃德加·巴勒斯到H·G·威尔斯，从阿西莫夫到阿瑟·克拉克，雷·布莱伯利、菲利普·迪克、威廉·巴勒斯、辛克莱·刘易斯，都曾是纸浆杂志的固定作者。",
  },
  {
    x: Date.UTC(1957),
    name: "20世纪50、60年代",
    label: "美苏冷战、战场太空化、环境问题暴露",
    description:
      "60年代，冷战正酣，美苏两国的核武器威胁着全人类的安全；" +
      "1957年苏联第一颗人造卫星上天，带来的不是欢呼，而是战场太空化的噩梦；" +
      "1962年《寂静的春天》第一次把环境问题揭露出来……从某种意义来说，这些全是科技的恶果。" +
      "同时，左翼政治力量兴起，东方宗教传播，流行艺术产生，迷幻药开始滥用……" +
      "整个60年代西方文化都处在动荡与变革中。科幻文学也开始了自己的新浪潮运动。",
  },
  {
    x: Date.UTC(1980),
    name: "1980年",
    label: "互联网原型系统诞生",
    description:
      "1946年2月14日，世界上第一台电脑ENIAC在美国宾夕法尼亚大学诞生。" +
      "没人知道它将改变世界。" +
      "1980年，在欧洲核子物理实验室工作的蒂姆·约翰·伯纳斯－李建议建立一个以超文本系统为基础的项目，" +
      "以便科学家之间能够分享和更新他们的研究结果，" +
      "他与另一个科学家罗勃·卡力奥一起建立了一个叫做ENQUIRE的原型系统。" +
      "这次，有一群人知道它将改变世界。那群人的名字叫做赛伯朋克作家。",
  },
  {
    x: Date.UTC(2021, 6, 17),
    name: "今天",
    label: "仰望星空，脚踏实地",
    description:
      "1946年2月14日，世界上第一台电脑ENIAC在美国宾夕法尼亚大学诞生。" +
      "没人知道它将改变世界。" +
      "1980年，在欧洲核子物理实验室工作的蒂姆·约翰·伯纳斯－李建议建立一个以超文本系统为基础的项目，" +
      "以便科学家之间能够分享和更新他们的研究结果，" +
      "他与另一个科学家罗勃·卡力奥一起建立了一个叫做ENQUIRE的原型系统。" +
      "这次，有一群人知道它将改变世界。那群人的名字叫做赛伯朋克作家。",
  },
];
