export const specialPeople = [
  {
    x: Date.UTC(1818),
    name: "玛丽·戈德温",
    //label: "玛丽·戈德温",
    description:
      "1937年，27岁的坎贝尔正式成为《惊人故事》的主编。" +
      "1938年3月，坎贝尔将杂志更名为《惊人科幻小说》" +
      "坎贝尔充分利用《惊人科幻小说》对科幻小说实施变革，强调科幻小说应该符合科学事实，体现正确的科学文化" +
      "坎贝尔的最大功绩就在于他以其独特的编辑方针造就了一大批科幻明星作家，以至于开创出史无前例的美国科幻黄金时代。" +
      "因此40年代也被称为“坎贝尔时代”，在很长一段时间内引导着科幻的发展。",
  },
  {
    x: Date.UTC(1849),
    name: "爱伦·坡",
    //label: "爱伦·坡",
  },
  {
    x: Date.UTC(1863),
    name: "凡尔纳",
    //label: "凡尔纳",
  },
  {
    x: Date.UTC(1895),
    name: "赫伯特·乔治·威尔斯",
    //label: "赫伯特·乔治·威尔斯",
  },
  // 黄金四子
  {
    x: Date.UTC(1939),
    name: "罗伯特·海因莱因",
    //label: "罗伯特·海因莱因",
  },
  {
    x: Date.UTC(1939),
    name: "A.E.范·沃格特",
    //label: "A.E.范·沃格特",
  },
  {
    x: Date.UTC(1941),
    name: "艾萨克·阿西莫夫",
    //label: "艾萨克·阿西莫夫",
  },
  {
    x: Date.UTC(1950),
    name: "雷·布雷德伯里",
    //label: "雷·布雷德伯里",
  },
  // 新浪潮四子
  {
    x: Date.UTC(1963),
    name: "菲利普·K.迪克",
    //label: "菲利普·K.迪克",
  },
  {
    x: Date.UTC(1965),
    name: "弗兰克·赫伯特",
    //label: "弗兰克·赫伯特",
  },
  {
    x: Date.UTC(1966),
    name: "罗杰·泽拉兹尼",
    //label: "罗杰·泽拉兹尼",
  },
  {
    x: Date.UTC(1968),
    name: "厄休拉·K.勒吉恩",
    //label: "厄休拉·K.勒吉恩",
  },
  // 赛博
  {
    x: Date.UTC(1984),
    name: "威廉·吉布森",
    //label: "威廉·吉布森",
  },
  {
    x: Date.UTC(1992),
    name: "尼尔·斯蒂芬森",
    //label: "尼尔·斯蒂芬森",
  },
  {
    x: Date.UTC(1993),
    name: "弗诺·文奇",
    //label: "弗诺·文奇",
  },
];
