export const scifiPeriod = [
  {
    x: Date.UTC(1810),
    name: "开端",
    label: "1818年",
    description:
      "在美国科幻小说史上，20世纪30年代末至60年代中期是一段特别的日子，名家辈出，佳作迭现，出版繁荣，" +
      "后人称之为科幻小说的黄金时代。一般把坎贝尔入主《惊人科幻小说》作为黄金时代的起点。<br/>" +
      "1957年以后，平装科幻书籍开始崛起，科幻杂志的鼎盛时期结束，美国科幻黄金时代也跟着结束了。",
    dataLabels: {
      color: "#FFBB00",
    },
  },
  {
    x: Date.UTC(1931),
    name: "黄金时代",
    label: "20世纪30年代末至60年代中期",
    description:
      "在美国科幻小说史上，20世纪30年代末至60年代中期是一段特别的日子，名家辈出，佳作迭现，出版繁荣，" +
      "后人称之为科幻小说的黄金时代。一般把坎贝尔入主《惊人科幻小说》作为黄金时代的起点。<br/>" +
      "1957年以后，平装科幻书籍开始崛起，科幻杂志的鼎盛时期结束，美国科幻黄金时代也跟着结束了。",
    dataLabels: {
      color: "#FFBB00",
    },
  },
  {
    x: Date.UTC(1965),
    name: "科幻新浪潮",
    label: "20世纪60年代中期至70年代中期",
    description:
      "在美国科幻小说史上，20世纪30年代末至60年代中期是一段特别的日子，名家辈出，佳作迭现，出版繁荣，" +
      "后人称之为科幻小说的黄金时代。一般把坎贝尔入主《惊人科幻小说》作为黄金时代的起点。" +
      "1957年以后，平装科幻书籍开始崛起，科幻杂志的鼎盛时期结束，美国科幻黄金时代也跟着结束了。",
    dataLabels: {
      color: "#9999FF",
    },
  },
  {
    x: Date.UTC(1984),
    name: "赛博朋克",
    label: "1984年诞生",
    description:
      "赛伯朋克（Cyberpunk）描绘的是社会边缘人如何把系统的统治技术变成他们自己的工具。" +
      "威廉·吉布森被誉为“赛伯朋克之父”，他的《神经浪游者》在1984年出版后引发了世界性的赛伯朋克文学运动。" +
      "这场运动还蔓延至其他领域，" +
      "出现了赛伯朋克风格的电影、音乐等，形成了许多带有叛逆性的亚文化群体。" +
      "现在赛伯朋克一词被用来泛指一种个人化、" +
      "玩世不恭、反权威、反信息控制的生活态度、生活方式。",
    dataLabels: {
      color: "#00DD00",
    },
  },
];
