export const scifiNode = [
  {
    x: Date.UTC(1818),
    name: "《弗兰肯斯坦》",
    label: "1818年玛丽《弗兰肯斯坦——现代普罗米修斯》在伦敦出版",
    description:
      "该作讲述小说主角弗兰肯斯坦是个热衷于生命起源的生物学家，" +
      "他怀着犯罪心理频繁出没于藏尸间，尝试用不同尸体的各个部分拼凑成一个巨大人体。" +
      "当这个怪物终于获得生命睁开眼睛时，弗兰肯斯坦被他的狰狞面目吓得弃他而逃，" +
      "他却紧追不舍地向弗兰肯斯坦索要女伴、温暖和友情；" +
      "接踵而至的更是一系列诡异的悬疑和命案。" +
      "该作被认为是世界第一部真正意义上的科幻小说。",
  },
  {
    x: Date.UTC(1926, 4, 5),
    name: "《惊奇故事》与“科幻杂志之父”雨果",
    label: "1926年4月5日，雨果·根斯巴克创办发行《惊奇故事》",
    description:
      "这是世界上第一本专门刊载科幻小说的刊物，而根斯巴克被誉为“科幻杂志之父”。" +
      "为了纪念根斯巴克所做的贡献，世界科幻协会于1953年以他的名字命名了科幻小说的创作奖——雨果奖。",
  },
  {
    x: Date.UTC(1937),
    name: "坎贝尔和《惊人科幻小说》",
    label: "1937年，坎贝尔入主《惊人科幻小说》",
    description:
      "1937年，27岁的坎贝尔正式成为《惊人故事》的主编。" +
      "1938年3月，坎贝尔将杂志更名为《惊人科幻小说》" +
      "坎贝尔充分利用《惊人科幻小说》对科幻小说实施变革，强调科幻小说应该符合科学事实，体现正确的科学文化" +
      "坎贝尔的最大功绩就在于他以其独特的编辑方针造就了一大批科幻明星作家，以至于开创出史无前例的美国科幻黄金时代。" +
      "因此40年代也被称为“坎贝尔时代”，在很长一段时间内引导着科幻的发展。",
  },
  {
    x: Date.UTC(1949),
    name: "《幻想与科幻杂志》和《银河科幻小说》",
    label: "1949年，《幻想与科幻杂志》创刊；<br/>次年《银河科幻小说》诞生",
    description:
      "《幻想与科幻杂志》的主编安东尼·鲍彻主张科幻小说应该提高自身的艺术性，既发表幻想小说，又发表科幻小说，" +
      "标志着科幻小说进入了一个多元发展时期。" +
      "《银河科幻小说》的主编H.L.戈尔德是二战后美国科幻界最具影响力的编辑。" +
      "他在曼哈顿的公寓是《银河科幻小说》的实权中心，丰富的作者联谊会聚集了一群未来的重要人物。" +
      "他能有效地促使他们有计划地写出许多一流的作品。" +
      "他还要求科幻小说未必一定描写科学家或工程师，也应该描写一般的普通人。他们仅仅是寻求生存，而不是设法拯救世界。" +
      "这些观点对坎贝尔影响下的科幻界来说具有革命性。",
  },
  {
    x: Date.UTC(1984, 12, 30),
    name: "“Cyberpunk”",
    label:
      "1984年，“Cyberpunk”被用以指称以《神经浪游者》<br/>为代表的新型科幻小说",
    description:
      "赛伯朋克（Cyberpunk）" +
      "这个词最早见于美国作家布鲁斯·贝斯克于1983年发表的短篇《Cyberpunk》。" +
      "1984年12月30日，《阿西莫夫科幻小说杂志》的编辑加德纳·多佐伊斯在《华盛顿邮报》上发表的回顾文章《新的热点作家》中" +
      "用“Cyberpunk”指称以威廉·吉布森《神经浪游者》为代表的新型科幻小说。",
  },
  {
    x: Date.UTC(2021, 6, 17),
    name: "今天",
    label: "仰望星空，脚踏实地",
    description:
      "赛伯朋克（Cyberpunk）" +
      "这个词最早见于美国作家布鲁斯·贝斯克于1983年发表的短篇《Cyberpunk》。" +
      "1984年12月30日，《阿西莫夫科幻小说杂志》的编辑加德纳·多佐伊斯在《华盛顿邮报》上发表的回顾文章《新的热点作家》中" +
      "用“Cyberpunk”指称以威廉·吉布森《神经浪游者》为代表的新型科幻小说。",
  },
];
